Repository: DartSiaProject/siahost
Catalog: project/sia_host_mobile/lib/src/core/l10n/arb/app_*.arb
Languages: fr

source: On track
fr: Sur la bonne voie

source: Total Storage
fr: Stockage total

source: Used Storage
fr: Stockage utilisé

source: Available Storage
fr: Stockage disponible

source: Total Contracts
fr: Contrats totaux

source: Active Contracts
fr: Contrats actifs

source: Upload Price
fr: Prix d'envoi

source: Download Price
fr: Prix de téléchargement

source: Storage Price
fr: Prix de stockage

source: Current Status
fr: Statut actuel

# acceptingContracts
source: Accepting Contract
fr: Accepte des contrats

source: Host Public Address
fr: Adresse publique de l'hôte

source: Address Copied successfully
fr: Adresse copiée avec succès.

# scPerTB
source: SC/TB
fr: SC/To

# byte
source: B
fr: o

# kiloByte
source: KB
fr: Ko

# megaByte
source: MB
fr: Mo

# gigaByte
source: GB
fr: Go

# teraByte
source: TB
fr: To

# petaByte
source: PB
fr: Po

source: Host
fr: Hôte

source: Yes
fr: Oui

source: No
fr: Non

source: Cancel
fr: Annuler

source: Online
fr: En ligne

source: Offline
fr: Hors ligne

source: Files
fr: Fichiers

source: File
fr: Fichier

source: Add File
fr: Ajouter un fichier

source: Open File
fr: Ouvrir le fichier

source: Delete File
fr: Supprimer le fichier

source: Rename File
fr: Renommer le fichier

source: Copy File
fr: Copier le fichier

source: Move File
fr: Déplacer le fichier

source: Notice
fr: Avis

source: Retry
fr: Réessayer

source: Delete
fr: Supprimer

source: Save
fr: Enregistrer

# createAt
source: Created at
fr: Créer le

# navHome
source: Home
fr: Accueil

# navSearch
source: Search
fr: Recherche

# navMyHost
source: My Host
fr: Mon Hôte

# navFiles
source: Files
fr: Fichiers

# homeTitle
source: Network Overview
fr: Aperçu du réseau

source: Current Active Hosts
fr: Hôtes actifs actuels

source: Total Network Storage
fr: Stockage total du réseau

source: Total Used Storage
fr: Stockage total utilisé

source: Price per TB
fr: Prix par To

# pricePerTBPerMonth
source: Price per TB/Month
fr: Prix par To/Mois

source: Daily Active Contracts
fr: Contrats actifs quotidiens

# searchTitle
source: Research a host
fr: Rechercher un hôte

# searchHint
source: Host public key
fr: Clé publique de l'hôte

# searchLabel
source: Enter the host public key address
fr: Entrez l'adresse de la clé publique de l'hôte

# hostInfo
source: Host Informations
fr: Informations sur l'hôte

# myHostTitle
source: My Host Overview
fr: Aperçu de mon hôte

source: Current Host Height
fr: Hauteur actuelle de l'hôte

source: Max Download Price
fr: Prix max de téléchargement

source: Max Upload Price
fr: Prix max d'envoi

source: Download Speed
fr: Vitesse de téléchargement

source: Upload Speed
fr: Vitesse d'envoi

source: Max Storage Price
fr: Prix max de stockage

source: Max Contracts Price
fr: Prix max des contrats

source: Min Account Expiry
fr: Expiration min du compte

source: Max RPC Price
fr: Prix max RPC

# hostConfigTitle
source: Host Configurations
fr: Configurations de l'hôte

# configButton
source: Configure
fr: Configurer

# hostConfigSuccess
source: Host data updated successfully
fr: Les données du server on été mises à jour.

# filesTitle
source: My Buckets
fr: Mes Buckets

# deleteNotifText
source: You are about to delete this alert.
fr: Vous êtes sur le point de supprimer cette alerte.

# deleteAllNotifText
source: You are about to delete all alerts from Renterd.
fr: Vous êtes sur le point de supprimer toutes les alertes de Renterd.

# failedDismissAlert
source: Failed to dismiss the alert.
fr: Échec de la suppression de l'alerte.

# failedFetchedMoreAlert
source: Failed to fetch more alerts.
fr: Échec de la récupération de plus d'alertes.

source: No Alert found !
fr: Aucune alerte trouvée!

# notifDetail
source: Alert Details
fr: Détails de l'alerte

# errorCancelled
source: Request was cancelled.
fr: La requête a été annulée.

# errorConnectionTimeout
source: Your device took too long time to connect to the server.
fr: Votre appareil a mis trop de temps à se connecter au serveur.

# errorNoInternet
source: No internet connection.
fr: Pas de connexion internet.

# errorReceiveTimeout
source: Your device took too long time to receive data from the server.
fr: Votre appareil a mis trop de temps à recevoir des données du serveur.

# errorSendTimeout
source: Your device took too long time to send data to the server.
fr: Votre appareil a mis trop de temps à envoyer des données au serveur.

# errorInvalidCertificate
source: Invalid certificate.
fr: Certificat invalide.

# errorUnauthorized
source: Unauthorized access.
fr: Accès non autorisé.

# errorForbidden
source: Access forbidden.
fr: Accès interdit.

# errorBadRequest
source: Bad request.
fr: Mauvaise requête.

# errorNotFound
source: Resource not found.
fr: Ressource non trouvée.

# errorConflict
source: Conflict detected.
fr: Conflit détecté.

# errorBadManip
source: Bad manipulation.
fr: Mauvaise manipulation.

# errorAccountDisabled
source: Account is disabled.
fr: Le compte est désactivé.

# errorUnprocessableEntity
source: Unprocessable entity.
fr: Entité non traitable.

# errorInternalServer
source: Internal server error.
fr: Erreur interne du serveur.

# errorProvider
source: Provider error.
fr: Erreur du fournisseur.

# errorOther
source: An unknown error occurred.
fr: Une erreur inconnue est survenue.

# errorBadMethod
source: Bad method.
fr: Mauvaise méthode.

# errorUnknown
source: Unknown error.
fr: Erreur inconnue.

# serverAddressField
source: Renterd Public Address
fr: Adresse publique Renterd

# serverAddressFieldHint
source: IPV4 address
fr: Adresse IPV4

# passwordField
source: Password
fr: Mot de passe Renterd

# emailField
source: Email Address
fr: Adresse e-mail

# loginButton
source: Connect
fr: Se connecter

# getStartedButton
source: Get Started
fr: Commencer

# onboardingTitle1
source: Host Control
fr: Contrôle de l'hôte

# onboardingTitle2
source: Visualize data
fr: Visualiser les données

# onboardingTitle3
source: Network data
fr: Données du réseau

# onboardingDesc1
source: Easily take control of your host no matter where you are via our mobile application.
fr: Prenez facilement le contrôle de votre hôte où que vous soyez via notre application mobile.

# onboardingDesc2
source: View your host's status data in real time as well as all of its activity on the Sia network.
fr: Consultez les données de statut de votre hôte en temps réel ainsi que toute son activité sur le réseau Sia.

# onboardingDesc3
source: You can visualize the state of the Sia network as well as all the exchanges of the hosts.
fr: Vous pouvez visualiser l'état du réseau Sia ainsi que tous les échanges des hôtes.

# loginDesc
source: To start interacting with the Sia network, please fill in the following fields.
fr: Pour commencer à interagir avec le réseau Sia, veuillez remplir les champs suivants.

# requiredField
source: This field is required.
fr: Ce champ est requis.

# invalidEmail
source: Invalid email address.
fr: L'adresse e-mail est invalide.

# invalidAddress
source: Invalid server address.
fr: L'adresse de l'hôte est invalide.

source: Invalid credentials.
fr: Données d'identification invalides.

source: Invalid address format.
fr: Le format de l'adresse est invalide.

# invalidForm
source: Please fill in all fields.
fr: Veuillez remplir tous les champs requis.

# cannotFindHostByKey
source: Cannot find the host with this public key.
fr: Aucun server n'a été trouvé avec cette clé publique.

# fileManagerTitle
source: File Manager
fr: Gestionnaire de fichiers

# fileManagerDesc
source: Manage your files and folders in the Sia network.
fr: Gerer vos fichiers.

# fileManagerEmpty
source: No files or folders found.
fr: Aucun fichiers ou dossiers trouvés.

# fileManagerEmptyDesc
source: You can create a new folder or upload files to the Sia network.
fr: Vous pouvez téléverser de nouveaux fichiers.

# fileManagerUpload
source: Upload
fr: Téléverser

# fileManagerCreateFolder
source: Create Folder
fr: Créer un dossier

# fileManagerLocal
source: Local Files
fr: Fichier Locaux

# fileManagerRemote
source: Remote Files
fr: Fichiers Servers

# noStoragePermission
source: Please accept storage permission first.
fr: Veuillez accepter les permissions d'accès au stockage.

# notEnoughSpace
source: Not enough space to download the file.
fr: Vous n'avez pas assez d'espace de stockage dans votre appareil.

source: Bucket Name
fr: Nom du bucket

# bucketNameHint
source: Enter the bucket name
fr: Saisir le nom du bucket

# invalidBucketNamePattern
source: The bucket name pattern is invalid
fr: Le pattern utilisé n'est pas correct

# bucketCreated
source: The bucket was successfully created.
fr: Le bucket a été créé avec succès.

# bucketNameRules
source: Bucket name must: - Be 3â€“63 characters - Use only letters, numbers, dots (.), and hyphens (-) - Start and end with a letter or number - Not be formatted as an IP address - Not contain consecutive periods
fr: Le nom du bucket doit: - Contenir entre 3 et 63 caractères - Utiliser uniquement des lettres, des chiffres, des points (.) et des tirets (-) - Commencer et finir par une lettre ou un chiffre - Ne pas être au format d'adresse IP - Ne pas contenir de points consécutifs

# newFileNameField
source: New File name
fr: Nouveau nom

# newFileNameHint
source: Enter new file name
fr: Saisir un nouveau nom

# uploadFile
source: Upload a File
fr: Uploader un fichier

# uploadFormNameField
source: Save File As
fr: Sauvegarder comme

# uploadAction
source: Upload
fr: Uploader

# pickFileTitle
source: Select a file
fr: Choisir un fichier

# pickFileDesc
source: Please select the file to upload
fr: Veuillez choisir le fichier a uploader

# pickedFileTitle
source: File picked
fr: Fichier choisi

# newFileOrDefault
source: Enter new file name or leave blank to save as default name
fr: Saisir le nom du fichier ou laisser le champ vide pour utiliser le nom par defaut.

# copyFormUseOldname
source: Keep Old file name
fr: Conserver l'ancien nom

# selectDestBucket
source: Select destination bucket
fr: Choisir la destination

# fileCopied
source: The file {name} has been copied successfully.
fr: Le fichier {name} a été copié avec succès.

# fileRenamed
source: The file {name} has been renamed successfully.
fr: Le fichier {name} a été renommé avec succès.

# fileMoved
source: The file {name} has been moved successfully.
fr: Le fichier {name} a été déplacé avec succès.

# fileDeleted
source: The file {name} has been deleted successfully.
fr: Le fichier {name} a été supprimé avec succès.

# fileUploaded
source: The file {name} has been uploaded successfully.
fr: Le fichier {name} a été uploadé avec succès.

# fileDownload
source: The file {name} has been downloaded successfully.
fr: Le fichier {name} a été téléchargé avec succès.

# deleteFileNotice
source: Delete a file
fr: Supprimer un fichier

# deleteFileDesc
source: You are about to delete a file. Continue ?
fr: Votre fichier sera définitivement supprimé. Continuer ?

source: Download File
fr: Télécharger le fichier

# downloadFileNotice
source: You need to download the file first before opening it
fr: Vous devez télécharger ce fichier avant de pouvoir l'ouvrir

# downloadAction
source: Download
fr: Télécharger

# downloadedFile
source: The file {name} has been downloaded successfully.
fr: Le fichier {name} a été téléchargé avec succès.

# downloadStart
source: Download started in background.
fr: Téléchargement en cours en arrière-plan.

# downloadAlreadyInProgress
source: Your file download is already in progress.
fr: Le téléchargement de votre fichier est déjà en cours. Veuillez patienter.

# unsupportedFileNotice
source: Unsupported file
fr: Fichier non supporté

# unsupportedFileDesc
source: We cannot open this file because it's unsupported.
fr: Nous ne pouvons pas ouvrir ce fichier car son format est non supporté.

# unsupportedOpenExternally
source: Try Externally
fr: Ouvrir avec une app externe

# chooseDifferentName
source: Choose a different name
fr: Choisir un nom différent

# wait
source: Please wait
fr: Veuillez patienter

source: Change Language
fr: Changer la langue d'affichage

# chooseLanguage
source: Choose your language
fr: Choisir une langue

source: French
fr: Français

source: English
fr: Anglais

# languageChanged
source: Language changed successfully.
fr: La langue a été changée avec succès.

# dbBackup
source: Database Backup
fr: Sauvegarde et restauration

# dbBackupDesc
source: Backup your database to a file or restore it from a file.
fr: Sauvegarder votre base de données sur un fichier ou la restaurer à partir d'un fichier.

# dbBackupButton
source: Backup
fr: Sauvegarder

# dbRestoreButton
source: Restore
fr: Restaurer

# dbBackupSuccess
source: Database backup was successful.
fr: La sauvegarde de la base de données a été effectuée avec succès.

# dbRestoreSuccess
source: Database restore was successful.
fr: La restauration de la base de données a été effectuée avec succès.

source: Cache Manager
fr: Gestionnaire de cache

# cacheManagerDesc
source: Manage your cache and clear it if needed.
fr: Gérer votre cache et le vider si nécessaire.

source: About
fr: À propos de l'application

# aboutDesc
source: DartSia is a mobile application that allows you to manage your host on the Sia network. It is open source and free to use.
fr: DartSia est une application mobile qui vous permet de gérer votre hôte sur le réseau Sia. Elle est open source et gratuite à utiliser.
